// Задача 062.
//Известно, что шахматная доска имеет размерность 8х8 и состоит из клеток двух цветов, например, черного и белого (см. рисунок). Каждая клетка имеет координату, состоящую из буквы и цифры. Горизонтальное расположение клетки определяется буквой от A до H, а вертикальное – цифрой от 1 до 8. Заметим, что клетка с координатой А1 имеет черный цвет. Требуется по заданной координате определить цвет клетки.

//Входные данные
//В единственной строке входного файла INPUT.TXT записана координата клетки на шахматной доске: всего два символа – буква и цифра (без пробелов).

//Выходные данные
//В выходной файл OUTPUT.TXT нужно вывести «WHITE», если указанная клетка имеет белый цвет и «BLACK», если она черная.


import java.util.Scanner;
 
public class Main {
    public static void main(String[] args) {
        String[] a = {"A", "B", "C", "D", "E", "F", "G", "H"};
        Scanner scanner = new Scanner(System.in);
        String s = scanner.nextLine();
         
        int index = java.util.Arrays.asList(a).indexOf(String.valueOf(s.charAt(0)));
        int number = Integer.parseInt(String.valueOf(s.charAt(1)));
         
        if (index % 2 == 0 && number % 2 == 1) {
            System.out.println("BLACK");
        } else if (index % 2 == 0 && number % 2 == 0) {
            System.out.println("WHITE");
        } else if (index % 2 == 1 && number % 2 == 1) {
            System.out.println("WHITE");
        } else if (index % 2 == 1 && number % 2 == 0) {
            System.out.println("BLACK");
        }
         
        scanner.close();
    }
}
