//Задача 069. https://acmp.ru/index.asp?main=task&id_task=69
//На одном известном автозаводе страны N-мерики главный инженер-рационализатор внес предложение вместо круглых колес использовать колеса в форме правильных N-угольников. "При этом", — сказал он, "важным показателем качества такого колеса будет разность между радиусом описанной окружности и радиусом вписанной окружности." Причем колесо считается качественным, если его показатель качества меньше единицы.

//Задано число N и длина A стороны N-угольного колеса. Необходимо определить: является ли такое колесо качественным.

//Входные данные
//Входной файл INPUT.TXT содержит два натуральных числа: N и A (3 ≤ N ≤ 1000, 1 ≤ A ≤ 1000).

//Выходные данные
//В выходной файл OUTPUT.TXT выведите «YES», если это качественное колесо и «NO» в противном случае.


import java.util.Scanner;
 
public class Main {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);
        int n = scanner.nextInt();
        int a = scanner.nextInt();
         
        double r1 = a / (2 * Math.tan(Math.toRadians(180.0 / n)));
        double r2 = a / (2 * Math.sin(Math.toRadians(180.0 / n)));
         
        if (r2 - r1 < 1) {
            System.out.println("YES");
        } else {
            System.out.println("NO");
        }
         
        scanner.close();
    }
}
