Задача 156. https://acmp.ru/index.asp?main=task&id_task=156
'''Требуется найти число способов расставить на шахматной доске N×N K ладей так, чтобы они не били друг друга. Все ладьи считаются одинаковыми.

Входные данные
Во входном файле INPUT.TXT записаны натуральные числа N и K (N, K ≤ 8).

Выходные данные
В выходной файл OUTPUT.TXT выведите одно целое число – ответ на задачу.'''

import math
def cnk(n ,k):
    return (math.factorial(n) / (math.factorial(k) * math.factorial(n - k)))
 
n, k = map(int, input().split())
if k > n:
    ans = 0
else:
    ans = cnk(n, k)   
    for i in range(k):
       ans *= (n - i)
print(int(ans))
