//задача 272. https://acmp.ru/index.asp?main=task&id_task=272
'''Задана последовательность целых чисел. Числа нумеруются по порядку следования, начиная с единицы.

Требуется написать программу, которая найдет сумму максимума из чисел с четными номерами и минимума из чисел с нечетными номерами – max{a2, a4, …}+min{a1, a3, …}.

Входные данные
Входной текстовый файл INPUT.TXT содержит в единственной строке последовательность от 2 до 2×105 целых чисел, которые по модулю не превышают 10000.

Выходные данные
Выходной текстовый файл OUTPUT.TXT должен содержать одно целое число - сумму максимума из чисел с четными номерами и минимума из чисел с нечетными номерами.'''


a = [int(i) for i in input().split()]
ma = -10000
mi = 10000
for i in range(len(a)):
    if i % 2 == 0:
        mi = min(a[i], mi)
    else:
        ma = max(a[i], ma)
print(mi+ma)
